Repository: AntoineBouchardBergeron/antoinebouchardbergeron.github.io
Catalog: src/locales/*/messages.po
Languages: fr

source: Home
fr: Acceuil

source: Software
fr: Logiciel

source: Mecanic
fr: Mécanique

source: Music
fr: Musique

source: 3D Printer park automation
fr: Automatisation du parc d'impression 3D

source: 3D Viewer web engine adaptation
fr: Adaptaion d'un visualisateur 3D

source: April 2018
fr: Avril 2018

source: Audit Intern
fr: Stagiaire en Audit

source: Audit testing
fr: Tests d'audits

source: August 2016
fr: Août 2016

source: August 2018
fr: Août 2018

source: August 2021
fr: Août 2021

source: Automation Pipeline
fr: Flux d'automatisation

source: Bass player and vocalist
fr: Bassiste et chanteux

source: Bass player and vocalist, that's it really..
fr: Bassiste et chanteur, c'est à peu près tout

source: Coming soon
fr: En écriture

source: Create and execute audit testing
fr: Créer et exécuter des tests d'audits

source: Creation of custom shader to create different effects, such as portals, water, and more.
fr: Création de 'nuanceur de vertex' (aka shader) pour créer différents effects tel que des portails, de l'eau et plus

source: Custom order service system for orthotic sole order. Used multiple services hosted on AWS, Amplify and then mainly, S3, EC2, SQS, AppRunner, RDS. This service was built as a Rest API exchanging information between the iOS app and the web service.
fr: Service de commande sur mesure pour des orthèses plantaires bati en utilisant plusieurs services hébergés sur AWS dont Amplify, puis, S3, EC2, AppRunner, RDS, SQS, et plus. Le service est bati comme un Rest API permettant l'échange d'information entre les bases de données et le portail web et l'app mobile iOS.

source: December 2018
fr: Décembre 2018

source: About.Learning.Description
fr: Ce faisant, j'ai consolidé mes connaissances de programmation fonctionnel en front-end (html? htmlx?, css). J'ai enfin appris également sur le procédé d'achat de domaine, d'hébergement sans passer par un des géants (quoique, github, c'est rendu plutôt gros non?)

source: Everything man
fr: Homme à tout faire

source: Helped the audit team with IT based audits, truth be told, I don't recall doing much there, lots of engineering documation and validation, but that's it.
fr: J'ai aidé l'équipe d'audit avec mes tests d'audits en TI. Je n'ai malheureusement pas de souvenir exact sur ce que j'ai fait, outre l'écriture de plusieurs documents de validations et de recommandations

source: About.WhyAnswer
fr: J'ai toujours été le genre a utiliser des raccourcis et (Je réalise maintenant que c'était une piètre approche) copier-coller. Je n'ai donc jamais approfondi mes connaissances de l'écriture du code fonctionnel. Depuis que j'ai l'occassion de retrouver du travail, j'ai été inspiré par mon bon ami <0>Pascal Laprade</0> à réécrire mon CV sous forme de web app, ce qui devrait me prouver être un bel apprentissage.

source: I made this a while ago, I ripped off some chords of a song and used the same as a beat, to motivate myself to study for an exam, but I ended up playing the bass and jamming on this pretty much all night.
fr: J'ai fait ça il y a longtemps, j'ai repris les mêmes accords d'une chanson que j'aimais à ce moment, et j'ai fait ce beat pour me motiver à étuider pour un examen, mais au final, j'ai surtout jammé à la basse au lieu d'étudier.

source: I made this while at my last year of uni, it was for a class in unreal engine and this was the menu song. I recorded a two more songs and with multiple track to layer and plug and play as a beat maker loop.
fr: J'ai fait ceci à ma dernière année à l'université, c'était pour un cours en unreal engine et ceci était la chanson du menu. J'ai du enregistrer 2 autres tounes avec plusieurs couche pour utiliser comme 'beat maker'

source: I was tasked with automating some of the repetitive tasks using VBS. I wish I could say more, but at the time of writing the summary, I truly don't remember, since it was almost 7 years ago.
fr: La première amélioration qu'on m'avait demandé dans mon stagé était d'automatiser des tâches répétitives en VBS, liant excel à E3.cables. J'aimerais donner plus d'informations, mais cela fait déjà 7 ans de ça et je m'en souviens plus trop..

source: I was tasked with automating some of the repetitive tasks using. Mainly I wrote a script that drew a Bill of Material right onto the CAD drawing. It saved collegues several hours each time they needed to copy from MS Office (either Work or Excel) into Autocad.
fr: Comme le projet d'automatisation avancait rapidement et qu'il restait du temps avant la fin de mon stage, on m'a demandé de me joindre à d'autres équipes de dessins afin de créer un 'Bill of Material' automatiquement à partir de word ou excel vers Autocad.

source: I was tasked with my collegues to build an app that would scan feet of our client's patient. The data would be safely sent to the Backend service built alongside the Order System Management (see above). We also added the possibility for our clients to complete the order right after taking the scans.
fr: Un des mandats qui nous a été confié était de construire une app iOS qui prends des scans des pieds des patients de nos clients. Les données prises étaient sécuritairement envoyées vers notre système de commandes.

source: I wrote, recorded, mixed all of this track by myself, pretty much self taugth, if you don't count the occassionnal youtube video. I wanted to record this because I was going on a trip and I used to play this little tune to my child every day!
fr: J'ai écrit, enregistré, mixé tout sur cette piste là moi-même, de façon plutôt autodidacte, si on ignore l'occassionnel vidéo youtube. Je voulais enregistrer cette chanson puisque je partais en voyage et j'avais l'habitudfe de jouer ceci chaque jour à ma fille!

source: About.Features3
fr: Inspectable (Pour trouver tout mes secrets!)

source: iOS App
fr: App iOS

source: iOS Ar app for shopping
fr: App iOS en réalité augmenté de magasinage

source: iOS Ar app for shopping, moslty developped with unity, but we had an ongoing project to store all of the gameobjects, 3ds, textures on Aws.S3 and feed them directly into the app. While it was not the best, for safety reasons, approach for this kind of distribution, it worked fine for the prototype.
fr: Application de réalité augmentée pour iOS développé dans Unity. L'aspect fullstack de ce projet réside dans l'hébergement des scènes virtuel dans un dépot aws.S3. Tout ces aspects étaient restés à l'état prototypale donc l'aspect iOS app -> S3 sans d'avantage de sécurités ne gênait pas.

source: iOS Mobile app
fr: Application mobile iOS

source: January 2011
fr: Janvier 2011

source: January 2024
fr: Janvier 2024

source: Key
fr: Éléments Clés

source: Lead the developpement for the prototyping of an AR app for luxury shopping
fr: Gérer le développement du prototypage d'un application en réalité virtuel pour de la vente d'accessoire de luxe

source: About.Learning
fr: Apprentissages

source: About.Intro
fr: Un homme simple, avec des intérets, des passes-temps et des connaissances écrit son Curriculum vitea en format web utilisant React, Typescript conservant un style fonctionnel

source: Managed a fullstack foot scanning services (web + native iOS with 3D services on AWS) to create 3d printable foot orthosis and more
fr: Gestion d'un service fullstack de prise d'empreinte de pied (web + iOS native avec services 3D sur aws) afin de générer des modèles 3D imprimable

source: About.Features1
fr: Stylé manuellement (Sass, css, scss, qui sait?)

source: May 2024
fr: Mai 2024

source: Milling GCode generator
fr: Générateur de code G pour fraisage

source: About.Features2
fr: Utilisation minimal de librairie/package (S'il y en a tout court (excepté React, on s'entend))

source: October 2021
fr: Octobre 2021

source: OnGoing
fr: En cours

source: Online CV
fr: Curriculum Vitea en ligne

source: Order system management
fr: Gestion de système de commande

source: Project Management
fr: Gestion de projet

source: Recommandation document writing
fr: Écriture de recommandations

source: Reviewed some SQL rollback actions and wrote conclusions on what when why
fr: Révision et approbation de requête SQL de type 'rollback' et écriture de conclusion sur comment, pourquoi, quand.

source: Rhino-Grasshopper Automation
fr: Automatisation de Rhino et Grasshopper

source: September 2017
fr: Septembre 2017

source: September 2019
fr: Septembre 2019

source: Shaders
fr: Vertex Shaders

source: Similar to the Rhino-Grasshopper Automation above, we were tasked previously to create a standalone webservice that would generate 3D post-processed GCode to mill out foam. The pathing was created with grasshopper script while the tool displacement was written in C#, with the conversion from List<Points> to a GCode executable.
fr: Similaire à l'automatisation de Rhino et Grasshopper, on a été mandaté à créer un service sur le cloud qui génère du code G pour fraisage à partir de configuration données et de scans de pieds existants. Le déplacement d'outil aura été recalculé par les normals du modèles reparamétré dans Grasshopper puis la List<Point> est transformée en 'Gcode post-processed'

source: So many things. Like, so many.
fr: Tellment de choses, 'genre', vraiment beaucoup.

source: Software Developper
fr: Développeur

source: Software Developper Intern
fr: Stagaire Développeur logiciel

source: Some of the modelisation was previously crafted via visual scripting with grasshopper and Rhino. So we've been tasked to write a service in .Net Framework that would listen to newly arrived 3D model with their inputed parameters which would create the relative and conform foot orthosis 3d model.
fr: Certaines étapes de modélisation étaient précédement complété via rhino et grasshopper en scriptage visuel. Nous avons donc créer un service .Net Framework qui recoit les différents modèles avec les prescriptions associés afin de gérérer les modèles 3D à imprimer.

source: Subsequent to the validation of IT processes, wrote recommandation for the different teams when they should change some of their processes in due time.
fr: En réponse à la validation des processus IT, j'ai écrit des recommandation pour les différentes équipes qu'ils devraient apporter sur les différents processus

source: The team had some previous tools that were written in Visual Basic which were really poorly written (4000+ lines methods, variable names unreadable (i.e: vim DoSt(vr, ae, vva, aas, mmb, etc.))) that I partly refactored.
fr: L'équipe avait des vieux outils qui étaient écrit en VisualBasic et de piètre qualité (4000 lignes et plus pour une fonction avec des noms de variables illisibles: vim DoSt(vr, ae, vva, aas, mmb, etc.)) que j'ai eu le temps de partiellement ré-usiner

source: This is basically a place for me to write about me, anb publish, maybe songs that I wrote myself or with my band, Coldsun
fr: Ici est un petit espace pour écrire de moi et peut-être publier des chansons que j'ai écrites moi-même ou avec le band dont je fais parti, Coldsun

source: This was recorded in coldsun drummer's basement. We have since improved the song quite a bit and mostly, are more at ease playing it. Also, you can totally hear the change to 7/4 and how incomfortable it made me while singing.<0/><1/>Vocals: JP, Antoine<2/>Guitar: JP,<3/>Bass: Antoine,<4/>Drums: Franco,<5/>Mixing: Antoine,<6/>Mastering: Antoine,<7/>Lyrics: Franco,<8/>Composition: JP, Franco, Antoine
fr: Celle-ci a été enregistré dans le sous-sol du drummer. On a depuis amélioré la chanson, mais on a pas de nouvel enregistrement présentable. De plus, on peut vraiment bien entendre le changement au 7/4 et à quel point j'étais inconfortable à chanter. <0/><1/>Voix: JP, Antoine<2/>Guitare: JP,<3/>Basse: Antoine,<4/>Drums: Franco,<5/>Mixing: Antoine,<6/>Mastering: Antoine,<7/>Paroles: Franco,<8/>Composition: JP, Franco, Antoine

source: Validation of IT processes
fr: Validation de processus IT

source: We explored creating our own queue system for our production team with the automation of self feeding 3D printing machine. The plan, which was never fully developped, was to have a cluster of printer working continuously, ejecting printed parts autonomously. We had a working prototype but we never were able to complete the ejection, which aborted the project.
fr: On a fait de l'exploration (aka. R&D) afin de créer notre propre système de queue pour l'automatisation de la production d'orthèse plantaires imprimés. Le plan, qui n'a jamais été complété, était d'avoir un group d'imprimante reliées par des raspberry pi qui lancerait le code d'éjection des pièces imprimées suivis du prochain item à imprimer dans la queue. Malheureusement, l'éjection n'a jamais réussi ce qui a arrêté le projet.

source: We used both github action to autobuild, autotest and autodeploy on a schedule. We also used a queue to start different services whenever available since some computation was made on a slower machine and took significant time, but was used 5% of the day, which was fine.
fr: On a utilisé les actions de github afin de fabriquer, tester et déplyer automatiquement les différents projets selon un horaire préétabli.

source: We used github project with its issues as a kanban tracker. We configured multiple views and were able to automate some of the tracking within the normal use of issues and pull requests statuses.
fr: L'utilisation de github project avec ses 'issues' comme ticket nous a servi de tracker kanban. J'avais configuré plusieurs vues permettant de mieux saisir l'évolution des projets. De plus, certaines étapes dans l'évolution des billets étaient automatisé grâce à des github 'actions'

source: We were tasked in adapting 3dviewer.net viewer to allow our users to see the 3D models of the scans as well as the completed orthotics. We added more functionnality in the viewer as well to pipe some of the locally used tool into a complete back-end service
fr: On m'a aussi demandé d'adapter le visualisation '3dviewer.net viewer' afin de permettre à nos utilisateurs de voir les modèles 3D des différents produits. De plus, j'ai ajouté des fonctionnalités qiu ont permis de décentraliser certains opérations effectuer localement précédement.

source: About.Why
fr: Pourquoi

source: Worked with an Electrical engineer team to automate some of their tasks
fr: J'ai travaillé avec une équipe d'ingénieur électrique afin d'automatiser certaines de leurs tâches.
